tap "libsql/sqld"
tap "r-lib/rig"
tap "tursodatabase/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Infocom-style interactive fiction player
brew "frotz"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Nonsense activity generator
brew "genact"
# GitHub command-line tool
brew "gh"
# Go manage your Ollama models
brew "gollama"
# Game of consumption
brew "greed"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tool to unpack installers created by Inno Setup
brew "innoextract"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Terminal spreadsheet multitool for discovering and arranging data
brew "visidata"
# Shell extension to navigate your filesystem faster
brew "zoxide"
brew "tursodatabase/tap/turso"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance-chamburr"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Menu bar manager
cask "jordanbaird-ice"
# Automation software
cask "keyboard-maestro"
# Discover, download, and run local LLMs
cask "lm-studio"
# Run LLMs locally
cask "msty"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# The R Installation Manager
cask "r-lib/rig/rig"
# System monitor for the menu bar
cask "stats"
# Native GUI tool for relational databases
cask "tableplus"
mas "Numbers", id: 409203825
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "divyamrit.alpine-snippets"
vscode "esbenp.prettier-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "pcbowers.alpine-intellisense"
vscode "sperovita.alpinejs-syntax-highlight"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "zarifprogrammer.tailwind-snippets"
