tap "r-lib/rig"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Infocom-style interactive fiction player
brew "frotz"
# Command-line fuzzy finder written in Go
brew "fzf"
# Nonsense activity generator
brew "genact"
# GitHub command-line tool
brew "gh"
# Game of consumption
brew "greed"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tool to unpack installers created by Inno Setup
brew "innoextract"
# Simple terminal UI for git commands
brew "lazygit"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Fast, disk space efficient package manager
brew "pnpm"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Terminal spreadsheet multitool for discovering and arranging data
brew "visidata"
# Shell extension to navigate your filesystem faster
brew "zoxide"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance-chamburr"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Menu bar manager
cask "jordanbaird-ice"
# Automation software
cask "keyboard-maestro"
# Run LLMs locally
cask "msty"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# The R Installation Manager
cask "r-lib/rig/rig"
# System monitor for the menu bar
cask "stats"
# Native GUI tool for relational databases
cask "tableplus"
